In [1]:
import pandas as pd

### lets read data

In [16]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    '.\\src_files\\users.csv', 
    sep='|', names=u_cols)

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [17]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv(
    '.\\src_files\\ratings.csv', 
    sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [26]:
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies = pd.read_csv(
    '.\\src_files\\movies_1.csv', 
    sep='|', names=m_cols, usecols=range(5))

movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

### Selecting Data

In [30]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [35]:
need_data =users[['occupation','sex']].head()

In [88]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [102]:
users[(users['age'] == 40) & (users['sex']== 'M')].head()  # age = 40 and sex is male

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629

In [143]:
a = users[(users['sex']=='F') & (users['occupation']=='programmer')].mean() # according to setisfied condition

In [144]:
a        # get all the data and applied mean

user_id     4.111667e+02
age         3.216667e+01
zip_code    1.578393e+29
dtype: float64

In [149]:
a['age']    # from the data we grabe specific filed

32.166666666666664

In [152]:
# we know that many ways to do single operation using mulitple techniques. so dont worry used according to 
# our choices,thinking,conditon {situation} of requirement and flexiblitly.

### Splitte -> Apply -> Combine  
###### from here our actual work will be start and this is most important part

In [267]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [304]:
g = ratings['movie_id'].groupby(ratings['user_id']).count()

In [322]:
g.head()

user_id
1    272
2     62
3     54
4     24
5    175
Name: movie_id, dtype: int64

In [349]:
aa=ratings[ratings.user_id == 186].sum()

In [351]:
aa

user_id                 17112
movie_id                44697
rating                    314
unix_timestamp    81181348894
dtype: int64

In [324]:
ratings['movie_id'].groupby(ratings['user_id']).count().head()

user_id
1    272
2     62
3     54
4     24
5    175
Name: movie_id, dtype: int64

In [355]:
x =['a','a','b','b','c','c']
y=[2,4,0,5,5,10]
z=['x','y']

In [358]:
df = pd.DataFrame([x,y],names=z)

NameError: name 'z' is not defined

In [359]:
ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [360]:
# get the average rating per movie

In [383]:
g_data = ratings.groupby(ratings['movie_id'])

In [428]:
data = g_data.mean()

In [429]:
high_rate =data['rating'].max()

In [433]:
aa=data[data['rating']==high_rate]

In [435]:
aa

             user_id  rating  unix_timestamp
movie_id
814        13.000000     5.0    8.863023e+08
1122       60.000000     5.0    8.833265e+08
1189      345.000000     5.0    8.885378e+08
1201       90.000000     5.0    8.913837e+08
1293      384.666667     5.0    8.887183e+08
1467      565.000000     5.0    8.783198e+08
1500      530.000000     5.0    8.774704e+08
1536      385.000000     5.0    8.794413e+08
1599      437.000000     5.0    8.801426e+08
1653      675.000000     5.0    8.894899e+08